In [1]:
# pandas的数据结构介绍
import numpy as np
import pandas as pd
from pandas import DataFrame
from pandas import Series

In [2]:
# Series

In [3]:
obj = Series([4, 7, -5, 3])
print(obj)
print(obj.values)
print(obj.index)

0    4
1    7
2   -5
3    3
dtype: int64
[ 4  7 -5  3]
RangeIndex(start=0, stop=4, step=1)

In [4]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
print(obj2)
print(obj2['a'])

d    4
b    7
a   -5
c    3
dtype: int64
-5

In [5]:
obj2['d'] = 6
print(obj2[['c', 'a', 'd']])

c    3
a   -5
d    6
dtype: int64

In [6]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [7]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [8]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [9]:
print('b' in obj2)
print('e' in obj2)

True
False

In [10]:
# Dict -> Series
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [11]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states) # 自动与dict的key匹配
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [12]:
print(pd.isnull(obj4))
print(pd.notnull(obj4))

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool
California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [13]:
print(obj3 + obj4) # 数据自动对齐

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [14]:
obj4.name = '人口'
obj4.index.name = '州'
obj4

州
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: 人口, dtype: float64

In [15]:
obj = Series([4, 7, -5, 3])
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan'] # 更新索引
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [16]:
# DataFrame

In [17]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data) # key对应frame的列名
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [18]:
frame = DataFrame(data, columns=['year', 'state', 'pop']) # 指定列顺序
frame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [19]:
frame2 = DataFrame(data,
                   columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five']) # 分别指定行列名字，缺失值自动填充，比如debt列。
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [20]:
print(frame2['state']) # 通过索引返回指定列，返回类型为Series
print(frame2.year)
print(type(frame.state))

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object
one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64
<class 'pandas.core.series.Series'>

In [21]:
print(frame2.loc['three']) # 使用loc访问行，iloc针对默认的数字索引
print(frame2.iloc[0])

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object
year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [22]:
frame2['debt'] = 16.5 # 修改整列值
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [23]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [24]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val # 索引不匹配的话自动补NaN
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [25]:
frame2['eastern'] = frame2.state == 'Ohio' # 根据其它列的条件赋布尔值
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [26]:
del frame2['eastern'] # 删除指定列
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [27]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop) # 通过嵌套字典指定列和行索引
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [28]:
frame3.T # 转置

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [29]:
DataFrame(pop, index=[2001, 2002, 2003]) # 索引2003匹配不到，自动填充NaN

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [30]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]} # 使用Series替代普通数组
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [31]:
frame3.index.name = 'year' # 设置索引和列的名字
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [32]:
print(frame3.values) # 以numpy数组形式返回values
print(type(frame3.values))

[[ nan  1.5]
 [ 2.4  1.7]
 [ 2.9  3.6]]
<class 'numpy.ndarray'>

In [33]:
# 索引对象

In [34]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index=index)
print(obj2)
obj2.index is index

0    1.5
1   -2.5
2    0.0
dtype: float64

True

In [35]:
print('Ohio' in frame3.columns)
print(2003 in frame3.index)

True
False

In [36]:
# Index的方法和属性
# append：      连接另一个Index对象，产生一个新的Index。
# diff：        计算差集，并得到一个Index。
# intersection：计算交集
# union：       计算并集
# isin：        计算一个指示各值是否都包含在参数集合中的布尔型数组
# delete：      删除索引i处的元素，并得到新的Index。
# drop：        删除传入的值，并得到新的Index。
# insert：      将元素插入到索引i处，并得到新的Index。
# is_monotonic：如果单调增长，返回True。
# is_unique：   当Index没有重复值时，返回True。
# unique：      计算Index中唯一值得数组